# buns_data.py

MESSAGES = [
    "@{user}, сегодня ты та самая булочка, которую все хотят попробовать! {bun} дня! 🥐✨",
    "@{user}, ты свеж, как утренний {bun}, а твоя харизма слаще самой вкусной глазури! 🍯",
    "@{user}, сегодня мир немного вкуснее, потому что ты — {bun}! 😋",
    "@{user}, тебя хочется унести домой и наслаждаться целый день, ведь ты — {bun}! 🍰",
    "@{user}, хрустишь, сияешь и радуешь всех вокруг, как идеальный {bun}! 🥐💛",
    "@{user}, если бы день был десертом, то ты был бы его самой сладкой частью — {bun}! 🍫",
    "@{user}, ты не просто {bun}, ты – произведение кондитерского искусства! 🎨🍩",
    "@{user}, обнять тебя – всё равно что съесть теплый {bun} с чашечкой кофе! ☕💕",
    "@{user}, ты – как идеальный {bun}: мягкий внутри, но с хрустящей корочкой! 🔥",
    "@{user}, быть {bun} – значит приносить радость, а ты делаешь это каждый день! 🎉",
]

IN_GAME_TEXT = [
    "Ты присоединился, @{user}! 🥳 Может, именно ты станешь булочкой дня! 🍩",
    "Отлично, @{user}, ты в игре! 🎉 Кто знает, может, ты — будущая булочка дня? 🥐",
    "Все готово, @{user}! 🔥 Время быть булочкой дня! 🍞 Ждем с нетерпением!",
    "Ты присоединился, @{user}, и кто знает... Может, ты — булочка дня? 🥯✨",
    "Ого, @{user}, ты в игре! 🏆 Кто станет булочкой дня — сюрприз! 🍪",
    "Ты с нами, @{user}! 🎮 Кто знает, может, ты станешь булочкой дня? 🍰",
    "Зарегистрирован, @{user}! 🥳 Может, именно твоя булочка окажется в центре внимания! 🥞",
    "Ты в игре, @{user}! 🥳 Кто знает, когда твоя булочка дня окажется на пьедестале? 🥖",
    "Добро пожаловать в игру, @{user}! 🎉 Возможно, ты — булочка дня, и мы это еще узнаем! 🥨",
    "Ты в игре, @{user}! 🚀 Время быть булочкой дня, независимо от того, когда это случится! 🥯",
]

SHURSHU_MESSAGES = [
    "Шуршу-муршу... На чьей стороне удача будет сегодня? 🤔✨",
    "Внимание! Судьба уже подготавливает тебя к великому событию! Кто будет булочкой дня? 🧐",
    "Мурчу и шуршу... Время узнать, кто сегодня зажжет! 🔥💥",
    "Секунду... подождите, магия только начинается! Кто же станет булочкой дня? 🧙‍♂️✨",
    "Готовы? Шуршу... Кто сегодня попадает в сладкую ловушку? 🍩🎯",
    "Тайна раскрыта! Но кто же станет булочкой дня? 😏",
    "Мур-мур... Судьба на твоей стороне? 🐾🍞",
    "Итак, шуршу! Кто сегодня окажется в центре сладкой славы? 🍰",
    "Все в ожидании... Кто будет той самой булочкой дня? 🍩💫",
    "Мурчу... Время загадок и сладких сюрпризов! Ты готов к чуду? ✨🍪",
]
